
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/mongulu-cm/mtchoun-mouh/actions/runs/7686873747)



<pre><code>Apply complete! Resources: 3 added, 3 changed, 1 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Running apply in the remote backend. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/tfc-mongulu-cm/mtchoun-mouh-lambda-layer/runs/run-Y6pTVrDotdmkMpTE

Waiting for the plan to start...

Terraform v1.5.4
on linux_amd64
Initializing plugins and modules...
null_resource.lambda_layer: Refreshing state... [id=572590456677590103]
data.archive_file.lambda_zip: Reading...
data.archive_file.lambda_zip: Read complete after 1s [id=6b48ecc0b5ee5af0b1a66623d63b72253afdf934]
data.aws_caller_identity.current: Reading...
data.aws_iam_role.role: Reading...
aws_cloudwatch_event_rule.scheduler: Refreshing state... [id=mtchoun-mouh-lambda-layer-trigger_user_scan]
aws_dynamodb_table.Users: Refreshing state... [id=mtchoun-mouh-lambda-layer-Users]
aws_api_gateway_rest_api.api: Refreshing state... [id=o1e3qkz6f9]
aws_dynamodb_table.Link_table: Refreshing state... [id=mtchoun-mouh-lambda-layer-Link_table]
aws_dynamodb_table.Register: Refreshing state... [id=mtchoun-mouh-lambda-layer-Register]
aws_s3_bucket.website: Refreshing state... [id=mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm]
aws_s3_bucket.images: Refreshing state... [id=mtchoun-mouh-lambda-layer-djansang]
data.aws_caller_identity.current: Read complete after 0s [id=053932140667]
data.aws_iam_role.role: Read complete after 0s [id=website-deployer]
aws_lambda_function.lambda: Refreshing state... [id=mtchoun-mouh-lambda-layer-user_registration_consulcam]
aws_lambda_function.scan: Refreshing state... [id=mtchoun-mouh-lambda-layer-scan_user_consulcam]
aws_api_gateway_resource.resource: Refreshing state... [id=rwxfg3]
aws_api_gateway_method.method: Refreshing state... [id=agm-o1e3qkz6f9-rwxfg3-POST]
module.cors.aws_api_gateway_method._: Refreshing state... [id=agm-o1e3qkz6f9-rwxfg3-OPTIONS]
aws_cloudwatch_event_target.target: Refreshing state... [id=mtchoun-mouh-lambda-layer-trigger_user_scan-lambda]
aws_lambda_permission.allow_cloudwatch_to_call_check_foo: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_api_gateway_method_response.method_response_200: Refreshing state... [id=agmr-o1e3qkz6f9-rwxfg3-POST-200]
aws_api_gateway_integration.integration: Refreshing state... [id=agi-o1e3qkz6f9-rwxfg3-POST]
module.cors.aws_api_gateway_integration._: Refreshing state... [id=agi-o1e3qkz6f9-rwxfg3-OPTIONS]
module.cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-o1e3qkz6f9-rwxfg3-OPTIONS-200]
aws_api_gateway_deployment.test: Refreshing state... [id=suutve]
module.cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-o1e3qkz6f9-rwxfg3-OPTIONS-200]
local_file.index_page: Refreshing state... [id=98f455ae6da3a4cb9d87a96da07698b2dfcc0530]
aws_s3_bucket_public_access_block.website: Refreshing state... [id=mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm]
aws_s3_bucket_object.example_file: Refreshing state... [id=index.html]
aws_s3_bucket_policy.website: Refreshing state... [id=mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "mtchoun-mouh-lambda-layer-user_registration_consulcam"
      ~ last_modified                  = "2023-10-01T10:29:02.000+0000" -> (known after apply)
      ~ layers                         = [] -> (known after apply)
      ~ source_code_hash               = "jHrjiGwuUY06vfQXZpa9VGa7gSuTUy3i+veidKXYOEU=" -> "utvZZJ0gL++TSbp06khXeV+UgRlbbI4ym3qYCB4fNBo="
        tags                           = {
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (16 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.test_lambda_layer will be created
  + resource "aws_lambda_layer_version" "test_lambda_layer" {
      + arn                         = (known after apply)
      + compatible_runtimes         = [
          + "python3.7",
          + "python3.8",
        ]
      + created_date                = (known after apply)
      + filename                    = "python.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "test_lambda_layer"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # aws_s3_bucket.images will be updated in-place
  ~ resource "aws_s3_bucket" "images" {
        id                          = "mtchoun-mouh-lambda-layer-djansang"
        tags                        = {
            "Name"        = "images"
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (10 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket.website will be updated in-place
  ~ resource "aws_s3_bucket" "website" {
        id                          = "mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm"
        tags                        = {
            "Name"        = "Website"
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (12 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

        # (3 unchanged blocks hidden)
    }

  # local_file.index_page will be created
  + resource "local_file" "index_page" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../html/index.html"
      + id                   = (known after apply)
    }

  # null_resource.lambda_layer is tainted, so must be replaced
-/+ resource "null_resource" "lambda_layer" {
      ~ id = "572590456677590103" -> (known after apply)
    }

Plan: 3 to add, 3 to change, 1 to destroy.


------------------------------------------------------------------------

Cost estimation:

Resources: 3 of 5 estimated
           $1.74096/mo +$0.0

------------------------------------------------------------------------

null_resource.lambda_layer: Destroying... [id=572590456677590103]
null_resource.lambda_layer: Destruction complete after 0s
null_resource.lambda_layer: Creating...
null_resource.lambda_layer: Provisioning with 'local-exec'...
null_resource.lambda_layer (local-exec): Executing: ["/bin/sh" "-c" "        /bin/bash\n\n        pip install virtualenv &&\\\n        virtualenv --python=/usr/bin/python3.8  test_lambda_layer &&\\\n        source python/bin/active\n        pip install -r api/requirements.txt -t python/lib/python3.8/site-pakages &&\\\n        ls test_lambda_layer &&\\\n        wget https://mongulu-files.s3.eu-central-1.amazonaws.com/7zz && chmod u+x 7zz &&\\\n        ./7zz a python.zip test_lambda_layer &&\\\n        ./7zz l python.zip\n"]
aws_s3_bucket.images: Modifying... [id=mtchoun-mouh-lambda-layer-djansang]
aws_s3_bucket.website: Modifying... [id=mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm]
local_file.index_page: Creating...
local_file.index_page: Creation complete after 0s [id=98f455ae6da3a4cb9d87a96da07698b2dfcc0530]
null_resource.lambda_layer (local-exec): Collecting virtualenv
null_resource.lambda_layer (local-exec):   Downloading virtualenv-20.25.0-py3-none-any.whl (3.8 MB)
null_resource.lambda_layer (local-exec): Collecting filelock<4,>=3.12.2
null_resource.lambda_layer (local-exec):   Downloading filelock-3.13.1-py3-none-any.whl (11 kB)
null_resource.lambda_layer (local-exec): Collecting distlib<1,>=0.3.7
null_resource.lambda_layer (local-exec):   Downloading distlib-0.3.8-py2.py3-none-any.whl (468 kB)
null_resource.lambda_layer (local-exec): Collecting platformdirs<5,>=3.9.1
null_resource.lambda_layer (local-exec):   Downloading platformdirs-4.1.0-py3-none-any.whl (17 kB)
null_resource.lambda_layer (local-exec): Installing collected packages: filelock, distlib, platformdirs, virtualenv
null_resource.lambda_layer (local-exec): Successfully installed distlib-0.3.8 filelock-3.13.1 platformdirs-4.1.0 virtualenv-20.25.0
null_resource.lambda_layer (local-exec): created virtual environment CPython3.8.10.final.0-64 in 1897ms
null_resource.lambda_layer (local-exec):   creator CPython3Posix(dest=/home/tfc-agent/.tfc-agent/component/terraform/runs/run-Y6pTVrDotdmkMpTE/config/test_lambda_layer, clear=False, no_vcs_ignore=False, global=False)
null_resource.lambda_layer (local-exec):   seeder FromAppData(download=False, pip=bundle, setuptools=bundle, wheel=bundle, via=copy, app_data_dir=/home/tfc-agent/.tfc-agent/component/terraform/runs/run-Y6pTVrDotdmkMpTE/.local/share/virtualenv)
null_resource.lambda_layer (local-exec):     added seed packages: pip==23.3.1, setuptools==69.0.2, wheel==0.42.0
null_resource.lambda_layer (local-exec):   activators BashActivator,CShellActivator,FishActivator,NushellActivator,PowerShellActivator,PythonActivator
null_resource.lambda_layer (local-exec): /bin/sh: 5: source: not found
null_resource.lambda_layer (local-exec): Collecting beautifulsoup4==4.9.1
null_resource.lambda_layer (local-exec):   Downloading beautifulsoup4-4.9.1-py3-none-any.whl (115 kB)
null_resource.lambda_layer (local-exec): Collecting certifi==2022.12.7
null_resource.lambda_layer (local-exec):   Downloading certifi-2022.12.7-py3-none-any.whl (155 kB)
null_resource.lambda_layer (local-exec): Collecting chardet==3.0.4
null_resource.lambda_layer (local-exec):   Downloading chardet-3.0.4-py2.py3-none-any.whl (133 kB)
null_resource.lambda_layer (local-exec): Collecting idna==2.10
null_resource.lambda_layer (local-exec):   Downloading idna-2.10-py2.py3-none-any.whl (58 kB)
null_resource.lambda_layer (local-exec): Collecting requests==2.31.0
null_resource.lambda_layer (local-exec):   Downloading requests-2.31.0-py3-none-any.whl (62 kB)
null_resource.lambda_layer (local-exec): Collecting soupsieve==2.0.1
null_resource.lambda_layer (local-exec):   Downloading soupsieve-2.0.1-py3-none-any.whl (32 kB)
null_resource.lambda_layer (local-exec): Collecting zulip==0.8.2
null_resource.lambda_layer (local-exec):   Downloading zulip-0.8.2-py3-none-any.whl (273 kB)
null_resource.lambda_layer (local-exec): Collecting sentry-sdk==1.14.0
null_resource.lambda_layer (local-exec):   Downloading sentry_sdk-1.14.0-py2.py3-none-any.whl (178 kB)
aws_s3_bucket.images: Modifications complete after 6s [id=mtchoun-mouh-lambda-layer-djansang]
null_resource.lambda_layer (local-exec): Collecting python-lambda==11.8.0
null_resource.lambda_layer (local-exec):   Downloading python_lambda-11.8.0-py3-none-any.whl (17 kB)
null_resource.lambda_layer (local-exec): Collecting charset-normalizer<4,>=2
null_resource.lambda_layer (local-exec):   Downloading charset_normalizer-3.3.2-cp38-cp38-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (141 kB)
null_resource.lambda_layer (local-exec): Collecting urllib3<3,>=1.21.1
null_resource.lambda_layer (local-exec):   Downloading urllib3-2.1.0-py3-none-any.whl (104 kB)
null_resource.lambda_layer (local-exec): Collecting matrix-client
null_resource.lambda_layer (local-exec):   Downloading matrix_client-0.4.0-py2.py3-none-any.whl (43 kB)
aws_s3_bucket.website: Modifications complete after 6s [id=mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm]
null_resource.lambda_layer (local-exec): Collecting typing-extensions>=3.7
null_resource.lambda_layer (local-exec):   Downloading typing_extensions-4.9.0-py3-none-any.whl (32 kB)
null_resource.lambda_layer (local-exec): Collecting distro
null_resource.lambda_layer (local-exec):   Downloading distro-1.9.0-py3-none-any.whl (20 kB)
null_resource.lambda_layer (local-exec): Collecting click
null_resource.lambda_layer (local-exec):   Downloading click-8.1.7-py3-none-any.whl (97 kB)
null_resource.lambda_layer (local-exec): Collecting boto3>=1.4.4
null_resource.lambda_layer (local-exec):   Downloading boto3-1.34.29-py3-none-any.whl (139 kB)
null_resource.lambda_layer (local-exec): Collecting PyYAML==5.1
null_resource.lambda_layer (local-exec):   Downloading PyYAML-5.1.tar.gz (274 kB)
null_resource.lambda_layer (local-exec): Collecting botocore<1.35.0,>=1.34.29
null_resource.lambda_layer (local-exec):   Downloading botocore-1.34.29-py3-none-any.whl (11.9 MB)
null_resource.lambda_layer: Still creating... [10s elapsed]
null_resource.lambda_layer (local-exec): Collecting s3transfer<0.11.0,>=0.10.0
null_resource.lambda_layer (local-exec):   Downloading s3transfer-0.10.0-py3-none-any.whl (82 kB)
null_resource.lambda_layer (local-exec): Collecting jmespath<2.0.0,>=0.7.1
null_resource.lambda_layer (local-exec):   Downloading jmespath-1.0.1-py3-none-any.whl (20 kB)
null_resource.lambda_layer (local-exec): Collecting python-dateutil<3.0.0,>=2.1
null_resource.lambda_layer (local-exec):   Downloading python_dateutil-2.8.2-py2.py3-none-any.whl (247 kB)
null_resource.lambda_layer (local-exec): Collecting six>=1.5
null_resource.lambda_layer (local-exec):   Downloading six-1.16.0-py2.py3-none-any.whl (11 kB)
null_resource.lambda_layer (local-exec): Building wheels for collected packages: PyYAML
null_resource.lambda_layer (local-exec):   Building wheel for PyYAML (setup.py): started
null_resource.lambda_layer (local-exec):   Building wheel for PyYAML (setup.py): finished with status 'done'
null_resource.lambda_layer (local-exec):   Created wheel for PyYAML: filename=PyYAML-5.1-cp38-cp38-linux_x86_64.whl size=44072 sha256=e97a66bf880b6c729cdb7cc482ff1b5c9e27196d3784d832c50f78115e3fec1f
null_resource.lambda_layer (local-exec):   Stored in directory: /home/tfc-agent/.tfc-agent/component/terraform/runs/run-Y6pTVrDotdmkMpTE/.cache/pip/wheels/52/dd/2b/10ff8b0ac81b93946bb5fb9e6749bae2dac246506c8774e6cf
null_resource.lambda_layer (local-exec): Successfully built PyYAML
null_resource.lambda_layer (local-exec): ERROR: matrix-client 0.4.0 has requirement urllib3~=1.21, but you'll have urllib3 2.1.0 which is incompatible.
null_resource.lambda_layer (local-exec): ERROR: botocore 1.34.29 has requirement urllib3<1.27,>=1.25.4; python_version < "3.10", but you'll have urllib3 2.1.0 which is incompatible.
null_resource.lambda_layer (local-exec): ERROR: python-lambda 11.8.0 has requirement click==6.6, but you'll have click 8.1.7 which is incompatible.
null_resource.lambda_layer (local-exec): Installing collected packages: soupsieve, beautifulsoup4, certifi, chardet, idna, charset-normalizer, urllib3, requests, matrix-client, typing-extensions, distro, click, zulip, sentry-sdk, jmespath, six, python-dateutil, botocore, s3transfer, boto3, PyYAML, python-lambda
null_resource.lambda_layer (local-exec): Successfully installed PyYAML-5.1 beautifulsoup4-4.9.1 boto3-1.34.29 botocore-1.34.29 certifi-2022.12.7 chardet-3.0.4 charset-normalizer-3.3.2 click-8.1.7 distro-1.9.0 idna-2.10 jmespath-1.0.1 matrix-client-0.4.0 python-dateutil-2.8.2 python-lambda-11.8.0 requests-2.31.0 s3transfer-0.10.0 sentry-sdk-1.14.0 six-1.16.0 soupsieve-2.0.1 typing-extensions-4.9.0 urllib3-2.1.0 zulip-0.8.2
null_resource.lambda_layer: Still creating... [20s elapsed]
null_resource.lambda_layer (local-exec): bin
null_resource.lambda_layer (local-exec): lib
null_resource.lambda_layer (local-exec): pyvenv.cfg
null_resource.lambda_layer (local-exec): --2024-01-28 16:04:56--  https://mongulu-files.s3.eu-central-1.amazonaws.com/7zz
null_resource.lambda_layer (local-exec): Resolving mongulu-files.s3.eu-central-1.amazonaws.com (mongulu-files.s3.eu-central-1.amazonaws.com)... 52.219.169.178, 3.5.134.122, 3.5.136.167, ...
null_resource.lambda_layer (local-exec): Connecting to mongulu-files.s3.eu-central-1.amazonaws.com (mongulu-files.s3.eu-central-1.amazonaws.com)|52.219.169.178|:443... connected.
null_resource.lambda_layer (local-exec): HTTP request sent, awaiting response...
null_resource.lambda_layer (local-exec): 200 OK
null_resource.lambda_layer (local-exec): Length: 2763304 (2.6M) [binary/octet-stream]
null_resource.lambda_layer (local-exec): Saving to: '7zz'

null_resource.lambda_layer (local-exec):      0K .......... .......... .......... .......... ..........  1%  185K 14s
null_resource.lambda_layer (local-exec):     50K .......... .......... .......... .......... ..........  3%  185K 14s
null_resource.lambda_layer (local-exec):    100K .......... .......... .......... .......... ..........  5%  185K 14s
null_resource.lambda_layer (local-exec):    150K .......... .......... .......... .......... ..........  7%  277K 12s
null_resource.lambda_layer (local-exec):    200K .......... .......... .......... .......... ..........  9%  274K 12s
null_resource.lambda_layer (local-exec):    250K .......... .......... .......... .......... .......... 11%  214K 11s
null_resource.lambda_layer (local-exec):    300K .......... .......... .......... .......... .......... 12%  231K 11s
null_resource.lambda_layer (local-exec):    350K .......... .......... .......... .......... .......... 14%  277K 10s
null_resource.lambda_layer (local-exec):    400K .......... .......... .......... .......... .......... 16%  345K 10s
null_resource.lambda_layer (local-exec):    450K .......... .......... .......... .......... .......... 18%  392K 9s
null_resource.lambda_layer (local-exec):    500K .......... .......... .......... .......... .......... 20%  280K 9s
null_resource.lambda_layer (local-exec):    550K .......... .......... .......... .......... .......... 22%  278K 9s
null_resource.lambda_layer (local-exec):    600K .......... .......... .......... .......... .......... 24%  545K 8s
null_resource.lambda_layer (local-exec):    650K .......... .......... .......... .......... .......... 25%  549K 7s
null_resource.lambda_layer (local-exec):    700K .......... .......... .......... .......... .......... 27%  280K 7s
null_resource.lambda_layer (local-exec):    750K .......... .......... .......... .......... .......... 29%  543K 7s
null_resource.lambda_layer (local-exec):    800K .......... .......... .......... .......... .......... 31%  350K 7s
null_resource.lambda_layer (local-exec):    850K .......... .......... .......... .......... .......... 33%  394K 6s
null_resource.lambda_layer (local-exec):    900K .......... .......... .......... .......... .......... 35%  546K 6s
null_resource.lambda_layer (local-exec):    950K .......... .......... .......... .......... .......... 37%  548K 6s
null_resource.lambda_layer (local-exec):   1000K .......... .......... .......... .......... .......... 38%  281K 6s
null_resource.lambda_layer (local-exec):   1050K .......... .......... .......... ........

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

ld_py.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....         6709         2028  test_lambda_layer/lib/python3.8/site-packages/setuptools/command/develop.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....         3560         1271  test_lambda_layer/lib/python3.8/site-packages/setuptools/command/dist_info.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....        86446        22865  test_lambda_layer/lib/python3.8/site-packages/setuptools/command/easy_install.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....        33758         9720  test_lambda_layer/lib/python3.8/site-packages/setuptools/command/editable_wheel.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....        26525         7565  test_lambda_layer/lib/python3.8/site-packages/setuptools/command/egg_info.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....         5627         2001  test_lambda_layer/lib/python3.8/site-packages/setuptools/command/install.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....         2066          773  test_lambda_layer/lib/python3.8/site-packages/setuptools/command/install_egg_info.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....         3870         1301  test_lambda_layer/lib/python3.8/site-packages/setuptools/command/install_lib.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....         2359          875  test_lambda_layer/lib/python3.8/site-packages/setuptools/command/install_scripts.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....          628          311  test_lambda_layer/lib/python3.8/site-packages/setuptools/command/launcher manifest.xml
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....          468          260  test_lambda_layer/lib/python3.8/site-packages/setuptools/command/register.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....         2097          763  test_lambda_layer/lib/python3.8/site-packages/setuptools/command/rotate.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....          657          324  test_lambda_layer/lib/python3.8/site-packages/setuptools/command/saveopts.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....         7085         2391  test_lambda_layer/lib/python3.8/site-packages/setuptools/command/sdist.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....         4927         1461  test_lambda_layer/lib/python3.8/site-packages/setuptools/command/setopt.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....         8101         2513  test_lambda_layer/lib/python3.8/site-packages/setuptools/command/test.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....          462          254  test_lambda_layer/lib/python3.8/site-packages/setuptools/command/upload.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....         7754         2622  test_lambda_layer/lib/python3.8/site-packages/setuptools/command/upload_docs.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 D....            0            0  test_lambda_layer/lib/python3.8/site-packages/setuptools/config
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....         1498          684  test_lambda_layer/lib/python3.8/site-packages/setuptools/config/__init__.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....        14723         4553  test_lambda_layer/lib/python3.8/site-packages/setuptools/config/_apply_pyprojecttoml.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 D....            0            0  test_lambda_layer/lib/python3.8/site-packages/setuptools/config/_validate_pyproject
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....         1038          479  test_lambda_layer/lib/python3.8/site-packages/setuptools/config/_validate_pyproject/__init__.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....        11266         3556  test_lambda_layer/lib/python3.8/site-packages/setuptools/config/_validate_pyproject/error_reporting.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....         1153          575  test_lambda_layer/lib/python3.8/site-packages/setuptools/config/_validate_pyproject/extra_validations.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....         1612          663  test_lambda_layer/lib/python3.8/site-packages/setuptools/config/_validate_pyproject/fastjsonschema_exceptions.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....       274908        22274  test_lambda_layer/lib/python3.8/site-packages/setuptools/config/_validate_pyproject/fastjsonschema_validations.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....         9160         2801  test_lambda_layer/lib/python3.8/site-packages/setuptools/config/_validate_pyproject/formats.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....        16388         5248  test_lambda_layer/lib/python3.8/site-packages/setuptools/config/expand.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....        17363         4747  test_lambda_layer/lib/python3.8/site-packages/setuptools/config/pyprojecttoml.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....        25531         6731  test_lambda_layer/lib/python3.8/site-packages/setuptools/config/setupcfg.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....          659          340  test_lambda_layer/lib/python3.8/site-packages/setuptools/dep_util.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....         5582         1898  test_lambda_layer/lib/python3.8/site-packages/setuptools/depends.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....        21147         6143  test_lambda_layer/lib/python3.8/site-packages/setuptools/discovery.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....        37205         9867  test_lambda_layer/lib/python3.8/site-packages/setuptools/dist.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....         2669          972  test_lambda_layer/lib/python3.8/site-packages/setuptools/errors.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....         5591         2158  test_lambda_layer/lib/python3.8/site-packages/setuptools/extension.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 D....            0            0  test_lambda_layer/lib/python3.8/site-packages/setuptools/extern
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....         2539          929  test_lambda_layer/lib/python3.8/site-packages/setuptools/extern/__init__.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....         4868         1467  test_lambda_layer/lib/python3.8/site-packages/setuptools/glob.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....        11776         6177  test_lambda_layer/lib/python3.8/site-packages/setuptools/gui-32.exe
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....        14336         6787  test_lambda_layer/lib/python3.8/site-packages/setuptools/gui-64.exe
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....        13824         5590  test_lambda_layer/lib/python3.8/site-packages/setuptools/gui-arm64.exe
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....        11776         6177  test_lambda_layer/lib/python3.8/site-packages/setuptools/gui.exe
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....         4989         1825  test_lambda_layer/lib/python3.8/site-packages/setuptools/installer.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....          812          409  test_lambda_layer/lib/python3.8/site-packages/setuptools/launch.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....         1239          557  test_lambda_layer/lib/python3.8/site-packages/setuptools/logging.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....          190           99  test_lambda_layer/lib/python3.8/site-packages/setuptools/modified.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....         4783         1742  test_lambda_layer/lib/python3.8/site-packages/setuptools/monkey.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....        47422         9526  test_lambda_layer/lib/python3.8/site-packages/setuptools/msvc.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....         3073         1107  test_lambda_layer/lib/python3.8/site-packages/setuptools/namespaces.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....        38345        10891  test_lambda_layer/lib/python3.8/site-packages/setuptools/package_index.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....          330          160  test_lambda_layer/lib/python3.8/site-packages/setuptools/py312compat.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....        14349         3911  test_lambda_layer/lib/python3.8/site-packages/setuptools/sandbox.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....          218          163  test_lambda_layer/lib/python3.8/site-packages/setuptools/script (dev).tmpl
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....          138          113  test_lambda_layer/lib/python3.8/site-packages/setuptools/script.tmpl
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....          941          380  test_lambda_layer/lib/python3.8/site-packages/setuptools/unicode_utils.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....          161          108  test_lambda_layer/lib/python3.8/site-packages/setuptools/version.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....         3697         1433  test_lambda_layer/lib/python3.8/site-packages/setuptools/warnings.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....         8628         2599  test_lambda_layer/lib/python3.8/site-packages/setuptools/wheel.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....          720          373  test_lambda_layer/lib/python3.8/site-packages/setuptools/windows_support.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 D....            0            0  test_lambda_layer/lib/python3.8/site-packages/setuptools-69.0.2.dist-info
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....            4            4  test_lambda_layer/lib/python3.8/site-packages/setuptools-69.0.2.dist-info/INSTALLER
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....         1023          593  test_lambda_layer/lib/python3.8/site-packages/setuptools-69.0.2.dist-info/LICENSE
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....         6272         1894  test_lambda_layer/lib/python3.8/site-packages/setuptools-69.0.2.dist-info/METADATA
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....        36403        11259  test_lambda_layer/lib/python3.8/site-packages/setuptools-69.0.2.dist-info/RECORD
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....           92           92  test_lambda_layer/lib/python3.8/site-packages/setuptools-69.0.2.dist-info/WHEEL
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....         2676          637  test_lambda_layer/lib/python3.8/site-packages/setuptools-69.0.2.dist-info/entry_points.txt
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....           41           41  test_lambda_layer/lib/python3.8/site-packages/setuptools-69.0.2.dist-info/top_level.txt
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....            0            0  test_lambda_layer/lib/python3.8/site-packages/setuptools-69.0.2.virtualenv
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:38 D....            0            0  test_lambda_layer/lib/python3.8/site-packages/wheel
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:38 .....           59           59  test_lambda_layer/lib/python3.8/site-packages/wheel/__init__.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:38 .....          455          257  test_lambda_layer/lib/python3.8/site-packages/wheel/__main__.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:38 .....          746          380  test_lambda_layer/lib/python3.8/site-packages/wheel/_setuptools_logging.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:38 .....        20943         6013  test_lambda_layer/lib/python3.8/site-packages/wheel/bdist_wheel.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:38 D....            0            0  test_lambda_layer/lib/python3.8/site-packages/wheel/cli
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:38 .....         4264         1369  test_lambda_layer/lib/python3.8/site-packages/wheel/cli/__init__.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:38 .....         9439         3008  test_lambda_layer/lib/python3.8/site-packages/wheel/cli/convert.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:38 .....         3110         1137  test_lambda_layer/lib/python3.8/site-packages/wheel/cli/pack.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:38 .....         4760         1424  test_lambda_layer/lib/python3.8/site-packages/wheel/cli/tags.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:38 .....         1021          527  test_lambda_layer/lib/python3.8/site-packages/wheel/cli/unpack.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:38 .....        16143         4117  test_lambda_layer/lib/python3.8/site-packages/wheel/macosx_libfile.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:38 .....         5882         2012  test_lambda_layer/lib/python3.8/site-packages/wheel/metadata.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:38 .....          621          286  test_lambda_layer/lib/python3.8/site-packages/wheel/util.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:38 D....            0            0  test_lambda_layer/lib/python3.8/site-packages/wheel/vendored
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:38 .....            0            0  test_lambda_layer/lib/python3.8/site-packages/wheel/vendored/__init__.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:38 D....            0            0  test_lambda_layer/lib/python3.8/site-packages/wheel/vendored/packaging
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:38 .....            0            0  test_lambda_layer/lib/python3.8/site-packages/wheel/vendored/packaging/__init__.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:38 .....         3266         1237  test_lambda_layer/lib/python3.8/site-packages/wheel/vendored/packaging/_elffile.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:38 .....         9526         3322  test_lambda_layer/lib/python3.8/site-packages/wheel/vendored/packaging/_manylinux.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:38 .....         2676         1197  test_lambda_layer/lib/python3.8/site-packages/wheel/vendored/packaging/_musllinux.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:38 .....        10382         2383  test_lambda_layer/lib/python3.8/site-packages/wheel/vendored/packaging/_parser.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:38 .....         1431          351  test_lambda_layer/lib/python3.8/site-packages/wheel/vendored/packaging/_structures.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:38 .....         5292         1801  test_lambda_layer/lib/python3.8/site-packages/wheel/vendored/packaging/_tokenizer.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:38 .....         8208         2686  test_lambda_layer/lib/python3.8/site-packages/wheel/vendored/packaging/markers.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:38 .....         2952         1055  test_lambda_layer/lib/python3.8/site-packages/wheel/vendored/packaging/requirements.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:38 .....        39206         8221  test_lambda_layer/lib/python3.8/site-packages/wheel/vendored/packaging/specifiers.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:38 .....        18355         5197  test_lambda_layer/lib/python3.8/site-packages/wheel/vendored/packaging/tags.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:38 .....         5268         1738  test_lambda_layer/lib/python3.8/site-packages/wheel/vendored/packaging/utils.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:38 .....        16236         4223  test_lambda_layer/lib/python3.8/site-packages/wheel/vendored/packaging/version.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:38 .....           16           16  test_lambda_layer/lib/python3.8/site-packages/wheel/vendored/vendor.txt
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:38 .....         7701         2485  test_lambda_layer/lib/python3.8/site-packages/wheel/wheelfile.py
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:38 D....            0            0  test_lambda_layer/lib/python3.8/site-packages/wheel-0.42.0.dist-info
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:38 .....            4            4  test_lambda_layer/lib/python3.8/site-packages/wheel-0.42.0.dist-info/INSTALLER
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:38 .....         1107          655  test_lambda_layer/lib/python3.8/site-packages/wheel-0.42.0.dist-info/LICENSE.txt
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:38 .....         2203          964  test_lambda_layer/lib/python3.8/site-packages/wheel-0.42.0.dist-info/METADATA
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:38 .....         4201         1719  test_lambda_layer/lib/python3.8/site-packages/wheel-0.42.0.dist-info/RECORD
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:38 .....           81           81  test_lambda_layer/lib/python3.8/site-packages/wheel-0.42.0.dist-info/WHEEL
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:38 .....          104           74  test_lambda_layer/lib/python3.8/site-packages/wheel-0.42.0.dist-info/entry_points.txt
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:38 .....            0            0  test_lambda_layer/lib/python3.8/site-packages/wheel-0.42.0.virtualenv
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39 .....          209          143  test_lambda_layer/pyvenv.cfg
null_resource.lambda_layer (local-exec): ------------------- ----- ------------ ------------  ------------------------
null_resource.lambda_layer (local-exec): 2024-01-28 16:04:39           26612779      9687562  825 files, 96 folders
null_resource.lambda_layer: Creation complete after 30s [id=9183777250135435678]
aws_lambda_layer_version.test_lambda_layer: Creating...
aws_lambda_layer_version.test_lambda_layer: Creation complete after 9s [id=arn:aws:lambda:eu-central-1:053932140667:layer:test_lambda_layer:1]
aws_lambda_function.lambda: Modifying... [id=mtchoun-mouh-lambda-layer-user_registration_consulcam]
aws_lambda_function.lambda: Still modifying... [id=mtchoun-mouh-lambda-layer-user_registration_consulcam, 10s elapsed]
aws_lambda_function.lambda: Modifications complete after 15s [id=mtchoun-mouh-lambda-layer-user_registration_consulcam]

Apply complete! Resources: 3 added, 3 changed, 1 destroyed.

Outputs:

register_table = "mtchoun-mouh-lambda-layer-Register"
stage_url = "https://o1e3qkz6f9.execute-api.eu-central-1.amazonaws.com/mtchoun-mouh-lambda-layer-dev"
website_url = "http://mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm.s3-website.eu-central-1.amazonaws.com"

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"deploy","PRNumber":144,"Program":"tfcmt","SHA1":"a54b7f8abc655c0b3d8a522fc850fa13511ee38c","Vars":{},"WorkflowName":"Deploy cases"} -->